[
    "قال رسول الله ﷺ: «من سلك طريقًا يلتمس فيه علمًا، سهل الله له به طريقًا إلى الجنة.»",
    "قال رسول الله ﷺ: «مثل المؤمنين في توادّهم وتراحمهم وتعاطفهم مثل الجسد، إذا اشتكى منه عضو تداعى له سائر الجسد بالسهر والحمى.»",
    "قال رسول الله ﷺ: «إن الله لا ينظر إلى صوركم وأموالكم، ولكن ينظر إلى قلوبكم وأعمالكم.»",
    "قال رسول الله ﷺ: «من لا يشكر الناس لا يشكر الله.»",
    "قال رسول الله ﷺ: «أحبّ الأعمال إلى الله أدومها وإن قل.»",
    "قال رسول الله ﷺ: «من كان يؤمن بالله واليوم الآخر فليقل خيرًا أو ليصمت.»",
    "قال رسول الله ﷺ: «اتق الله حيثما كنت، وأتبع السيئة الحسنة تمحها، وخالق الناس بخلق حسن.»",
    "قال رسول الله ﷺ: «الدين النصيحة.» قلنا: لمن يا رسول الله؟ قال: «لله ولكتابه ولرسوله ولأئمة المسلمين وعامتهم.»",
    "قال رسول الله ﷺ: «لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه.»",
    "قال رسول الله ﷺ: «يسروا ولا تعسروا، وبشروا ولا تنفروا.»",
    "قال رسول الله ﷺ: «المسلم من سلم المسلمون من لسانه ويده.»",
    "قال رسول الله ﷺ: «الطهور شطر الإيمان.»",
    "قال رسول الله ﷺ: «لا ضرر ولا ضرار.»",
    "قال رسول الله ﷺ: «إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى.»",
    "قال رسول الله ﷺ: «إن الله كتب الإحسان على كل شيء.»",
    "قال رسول الله ﷺ: «الكلمة الطيبة صدقة.»",
    "قال رسول الله ﷺ: «دع ما يريبك إلى ما لا يريبك.»",
    "قال رسول الله ﷺ: «من حسن إسلام المرء تركه ما لا يعنيه.»",
    "قال رسول الله ﷺ: «إن الله لا يقبض العلم انتزاعًا، ولكن يقبض العلم بقبض العلماء.»",
    "قال رسول الله ﷺ: «من لا يَرحم لا يُرحم.»",
    "قال رسول الله ﷺ: «الراحمون يرحمهم الرحمن.»",
    "قال رسول الله ﷺ: «إنما بعثت لأتمم مكارم الأخلاق.»",
    "قال رسول الله ﷺ: «من دلّ على خير فله مثل أجر فاعله.»",
    "قال رسول الله ﷺ: «من صلى عليّ صلاة صلى الله عليه بها عشرًا.»",
    "قال رسول الله ﷺ: «خيركم من تعلم القرآن وعلمه.»",
    "قال رسول الله ﷺ: «اللهم أعني على ذكرك وشكرك وحسن عبادتك.»",
    "قال رسول الله ﷺ: «من غشنا فليس منا.»",
    "قال رسول الله ﷺ: «البر لا يبلى، والذنب لا ينسى، والديان لا يموت.»",
    "قال رسول الله ﷺ: «رحم الله امرأً سمحًا إذا باع، وإذا اشترى، وإذا اقتضى.»",
    "قال رسول الله ﷺ: «من كان في حاجة أخيه كان الله في حاجته.»",
    "قال رسول الله ﷺ: «لا تغضب.» فردد مرارًا قال: «لا تغضب.»",
    "قال رسول الله ﷺ: «تبسمك في وجه أخيك صدقة.»",
    "قال رسول الله ﷺ: «إن الله جميل يحب الجمال.»",
    "قال رسول الله ﷺ: «المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف.»",
    "قال رسول الله ﷺ: «من ستر مسلمًا ستره الله في الدنيا والآخرة.»",
    "قال رسول الله ﷺ: «من لا يشكر القليل لا يشكر الكثير.»",
    "قال رسول الله ﷺ: «من صمت نجا.»",
    "قال رسول الله ﷺ: «خير الناس أنفعهم للناس.»",
    "قال رسول الله ﷺ: «إن أحب الأعمال إلى الله سرور تدخله على مسلم.»",
    "قال رسول الله ﷺ: «إن من أحبكم إليّ وأقربكم مني مجلسًا يوم القيامة أحاسنكم أخلاقًا.»",
    "قال رسول الله ﷺ: «ما نقصت صدقة من مال.»",
    "قال رسول الله ﷺ: «أفضل الصدقة سقي الماء.»",
    "قال رسول الله ﷺ: «ليس الشديد بالصرعة، إنما الشديد الذي يملك نفسه عند الغضب.»",
    "قال رسول الله ﷺ: «الحياء لا يأتي إلا بخير.»",
    "قال رسول الله ﷺ: «الدعاء هو العبادة.»",
    "قال رسول الله ﷺ: «الدنيا سجن المؤمن وجنة الكافر.»",
    "قال رسول الله ﷺ: «الرفق لا يكون في شيء إلا زانه.»",
    "قال رسول الله ﷺ: «من كان له ثلاث بنات فصبر عليهن... أدخله الله الجنة.»",
    "قال رسول الله ﷺ: «من عادى لي وليًا فقد آذنته بالحرب.»",
    "قال رسول الله ﷺ: «من أحسن في الإسلام لم يؤاخذ بما عمل في الجاهلية.»",
    "قال رسول الله ﷺ: «من نفس عن مؤمن كربة من كرب الدنيا، نفس الله عنه كربة من كرب يوم القيامة.»",
    "قال رسول الله ﷺ: «ومن يسر على معسر، يسر الله عليه في الدنيا والآخرة.»",
    "قال رسول الله ﷺ: «ومن ستر مسلمًا، ستره الله في الدنيا والآخرة.»",
    "قال رسول الله ﷺ: «والله في عون العبد ما كان العبد في عون أخيه.»",
    "قال رسول الله ﷺ: «ما اجتمع قوم في بيت من بيوت الله، يتلون كتاب الله، ويتدارسونه بينهم، إلا نزلت عليهم السكينة.»",
    "قال رسول الله ﷺ: «وغشيتهم الرحمة، وحفتهم الملائكة، وذكرهم الله فيمن عنده.»",
    "قال رسول الله ﷺ: «من بطأ به عمله لم يسرع به نسبه.»",
    "قال رسول الله ﷺ: «كل ابن آدم خطاء، وخير الخطائين التوابون.»",
    "قال رسول الله ﷺ: «من توضأ فأحسن الوضوء خرجت خطاياه من جسده حتى تخرج من تحت أظفاره.»",
    "قال رسول الله ﷺ: «لا تحقرن من المعروف شيئًا ولو أن تلقى أخاك بوجه طليق.»",
    "قال رسول الله ﷺ: «من دعا إلى هدى، كان له من الأجر مثل أجور من تبعه لا ينقص ذلك من أجورهم شيئًا.»",
    "قال رسول الله ﷺ: «من دعا إلى ضلالة، كان عليه من الإثم مثل آثام من تبعه لا ينقص من آثامهم شيئًا.»",
    "قال رسول الله ﷺ: «من كان يؤمن بالله واليوم الآخر فلا يؤذِ جاره.»",
    "قال رسول الله ﷺ: «ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه.»",
    "قال رسول الله ﷺ: «المؤمن مرآة المؤمن.»",
    "قال رسول الله ﷺ: «من أحب لله، وأبغض لله، وأعطى لله، ومنع لله، فقد استكمل الإيمان.»",
    "قال رسول الله ﷺ: «من لا يُؤتمن لا إيمان له، ومن لا عهد له لا دين له.»",
    "قال رسول الله ﷺ: «كل معروف صدقة.»",
    "قال رسول الله ﷺ: «إذا مات الإنسان انقطع عمله إلا من ثلاث: صدقة جارية، أو علم ينتفع به، أو ولد صالح يدعو له.»",
    "قال رسول الله ﷺ: «اليد العليا خير من اليد السفلى.»",
    "قال رسول الله ﷺ: «إن الله رفيق يحب الرفق في الأمر كله.»",
    "قال رسول الله ﷺ: «إن الرفق لا يكون في شيء إلا زانه، ولا ينزع من شيء إلا شانه.»",
    "قال رسول الله ﷺ: «الظلم ظلمات يوم القيامة.»",
    "قال رسول الله ﷺ: «من يرد الله به خيرًا يفقهه في الدين.»",
    "قال رسول الله ﷺ: «من توضأ مثل وضوئي هذا ثم صلى ركعتين لا يحدث فيهما نفسه، غفر له ما تقدم من ذنبه.»",
    "قال رسول الله ﷺ: «الدعاء لا يرد بين الأذان والإقامة.»",
    "قال رسول الله ﷺ: «من قال حين يسمع المؤذن: أشهد أن لا إله إلا الله وحده لا شريك له... غفرت له ذنوبه.»",
    "قال رسول الله ﷺ: «من صلى عليّ واحدة، صلى الله عليه بها عشرًا.»",
    "قال رسول الله ﷺ: «إذا دخل رمضان فُتحت أبواب الجنة، وغُلقت أبواب النار، وسُلسلت الشياطين.»",
    "قال رسول الله ﷺ: «صوموا لرؤيته، وأفطروا لرؤيته.»",
    "قال رسول الله ﷺ: «من صام رمضان إيمانًا واحتسابًا غفر له ما تقدم من ذنبه.»",
    "قال رسول الله ﷺ: «من قام رمضان إيمانًا واحتسابًا غفر له ما تقدم من ذنبه.»",
    "قال رسول الله ﷺ: «من قام ليلة القدر إيمانًا واحتسابًا غفر له ما تقدم من ذنبه.»",
    "قال رسول الله ﷺ: «من فطر صائمًا كان له مثل أجره.»",
    "قال رسول الله ﷺ: «إن الله وملائكته يصلون على المتسحرين.»",
    "قال رسول الله ﷺ: «للصائم فرحتان: فرحة عند فطره، وفرحة عند لقاء ربه.»",
    "قال رسول الله ﷺ: «الصيام جُنة، فإذا كان يوم صوم أحدكم فلا يرفث ولا يصخب.»",
    "قال رسول الله ﷺ: «لخلوف فم الصائم أطيب عند الله من ريح المسك.»",
    "قال رسول الله ﷺ: «في الجنة باب يقال له الريان، لا يدخله إلا الصائمون.»",
    "قال رسول الله ﷺ: «من قرأ حرفًا من كتاب الله فله به حسنة، والحسنة بعشر أمثالها.»",
    "قال رسول الله ﷺ: «خيركم من قرأ القرآن وعلمه.»",
    "قال رسول الله ﷺ: «اقرؤوا القرآن، فإنه يأتي يوم القيامة شفيعًا لأصحابه.»",
    "قال رسول الله ﷺ: «إن لله أهلين من الناس، قيل من هم؟ قال: أهل القرآن، هم أهل الله وخاصته.»",
  "قال رسول الله ﷺ: «من توضأ فأحسن الوضوء ثم قال: أشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله، فُتحت له أبواب الجنة الثمانية يدخل من أيها شاء.»",
  "قال رسول الله ﷺ: «إن الرجل ليتكلم بالكلمة لا يرى بها بأسًا يهوي بها سبعين خريفًا في النار.»",
  "قال رسول الله ﷺ: «المؤمن يألف ويؤلف، ولا خير فيمن لا يألف ولا يؤلف.»",
  "قال رسول الله ﷺ: «من حديث نفسه بقتل نفسه فليعذب بها يوم القيامة.»",
  "قال رسول الله ﷺ: «من أحب لقاء الله أحب الله لقاءه.»",
  "قال رسول الله ﷺ: «الدنيا ملعونة ملعون ما فيها إلا ذكر الله وما والاه، وعالم أو متعلم.»",
  "قال رسول الله ﷺ: «من صام يومًا في سبيل الله باعد الله وجهه عن النار سبعين خريفًا.»",
  "قال رسول الله ﷺ: «ليس منا من لم يوقر كبيرنا ويرحم صغيرنا ويعرف لعالمنا حقه.»",
  "قال رسول الله ﷺ: «من صلى الفجر في جماعة فهو في ذمة الله.»",
  "قال رسول الله ﷺ: «ما من أيام العمل الصالح فيهن أحب إلى الله من هذه الأيام العشر.»",
  "قال رسول الله ﷺ: «إن الله تعالى طيب لا يقبل إلا طيبًا.»",
  "قال رسول الله ﷺ: «يا غلام، سم الله، وكل بيمينك، وكل مما يليك.»",
  "قال رسول الله ﷺ: «من سنّ في الإسلام سنة حسنة فله أجرها وأجر من عمل بها.»",
  "قال رسول الله ﷺ: «من سنّ في الإسلام سنة سيئة فعليه وزرها ووزر من عمل بها.»",
  "قال رسول الله ﷺ: «المرء مع من أحب.»",
  "قال رسول الله ﷺ: «من حسن إسلام المرء قلة الكلام فيما لا يعنيه.»",
  "قال رسول الله ﷺ: «الجار قبل الدار.»",
  "قال رسول الله ﷺ: «المؤمنون تتكافأ دماؤهم، وهم يد على من سواهم.»",
  "قال رسول الله ﷺ: «صيام يوم عرفة أحتسب على الله أن يكفّر السنة التي قبله والتي بعده.»",
  "قال رسول الله ﷺ: «حُفت الجنة بالمكاره، وحُفت النار بالشهوات.»",
  "قال رسول الله ﷺ: «ازهد في الدنيا يحبك الله، وازهد فيما عند الناس يحبك الناس.»",
  "قال رسول الله ﷺ: «دعوة المظلوم مستجابة، ولو كان فاجرًا، ففجوره على نفسه.»",
  "قال رسول الله ﷺ: «ليس الشأن أن تُصيب، إنما الشأن أن تسلم من الخطأ.»",
  "قال رسول الله ﷺ: «الخلق كلهم عيال الله، فأحب الخلق إلى الله أنفعهم لعياله.»",
  "قال رسول الله ﷺ: «سيد الاستغفار أن تقول: اللهم أنت ربي لا إله إلا أنت...»",
  "قال رسول الله ﷺ: «القرآن حجة لك أو عليك.»",
  "قال رسول الله ﷺ: «لا يزال لسانك رطبًا بذكر الله.»",
  "قال رسول الله ﷺ: «من أصبح منكم آمنًا في سربه، معافى في بدنه، عنده قوت يومه، فكأنما حيزت له الدنيا.»",
  "قال رسول الله ﷺ: «إن الله تجاوز لأمتي عما وسوست به صدورها ما لم تعمل أو تتكلم.»",
  "قال رسول الله ﷺ: «ليس المؤمن بطعّان ولا لعّان ولا فاحش ولا بذيء.»",
  "قال رسول الله ﷺ: «سباب المسلم فسوق وقتاله كفر.»",
  "قال رسول الله ﷺ: «إن الله كتب الإحسان على كل شيء، فإذا قتلتم فأحسنوا القتلة، وإذا ذبحتم فأحسنوا الذبحة.»",
  "قال رسول الله ﷺ: «استعينوا على قضاء حوائجكم بالكتمان.»",
  "قال رسول الله ﷺ: «ثلاث من كنّ فيه وجد بهنّ حلاوة الإيمان: أن يكون الله ورسوله أحب إليه مما سواهما...».",
  "قال رسول الله ﷺ: «كل أمتي يدخلون الجنة إلا من أبى.» قيل: ومن يأبى؟ قال: «من أطاعني دخل الجنة، ومن عصاني فقد أبى.»",
  "قال رسول الله ﷺ: «ما من عبد يصوم يومًا في سبيل الله إلا باعد الله وجهه عن النار سبعين خريفًا.»",
  "قال رسول الله ﷺ: «لا طاعة لمخلوق في معصية الخالق.»",
  "قال رسول الله ﷺ: «من قال رضيت بالله ربًا، وبالإسلام دينًا، وبمحمد ﷺ نبيًا، وجبت له الجنة.»",
  "قال رسول الله ﷺ: «اللهم إنك عفو تحب العفو فاعفُ عني.»",
  "قال رسول الله ﷺ: «يا معشر من آمن بلسانه ولم يدخل الإيمان في قلبه! لا تغتابوا المسلمين.»",
  "قال رسول الله ﷺ: «من صلّى عليّ واحدة صلى الله عليه عشرًا.»",
  "قال رسول الله ﷺ: «إن لله تسعةً وتسعين اسمًا، من أحصاها دخل الجنة.»",
  "قال رسول الله ﷺ: «إن الله إذا أحب عبدًا نادى جبريل: إني أحب فلانًا فأحبّه.»",
  "قال رسول الله ﷺ: «إن لكل دين خُلُقًا، وإن خُلق الإسلام الحياء.»",
  "قال رسول الله ﷺ: «الصدق يهدي إلى البر، والبر يهدي إلى الجنة.»",
  "قال رسول الله ﷺ: «إياكم والظن، فإن الظن أكذب الحديث.»",
  "قال رسول الله ﷺ: «من ستر مسلمًا ستره الله في الدنيا والآخرة.»",
  "قال رسول الله ﷺ: «إذا أحب الله عبدًا نادى: يا جبريل، إني أحب فلانًا فأحبه.»",
  "قال رسول الله ﷺ: «من مات وهو يعلم أنه لا إله إلا الله دخل الجنة.»",
  "قال رسول الله ﷺ: «من كان يؤمن بالله واليوم الآخر فليكرم ضيفه.»",
  "قال رسول الله ﷺ: «لا تحقرن من المعروف شيئًا، ولو أن تلقى أخاك بوجه طلق.»",
  "قال رسول الله ﷺ: «ارحموا من في الأرض يرحمكم من في السماء.»",
  "قال رسول الله ﷺ: «من لا يَرحم لا يُرحم.»",
  "قال رسول الله ﷺ: «إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى.»",
  "قال رسول الله ﷺ: «المسلم من سلم المسلمون من لسانه ويده.»",
  "قال رسول الله ﷺ: «المؤمن لا يكذب.»",
  "قال رسول الله ﷺ: «يسروا ولا تعسروا، وبشروا ولا تنفروا.»",
  "قال رسول الله ﷺ: «من لا يُجيد الشكر لا يُجيد العبادة.»",
  "قال رسول الله ﷺ: «كل المسلم على المسلم حرام: دمه وماله وعرضه.»",
  "قال رسول الله ﷺ: «أدِّ الأمانة إلى من ائتمنك، ولا تخن من خانك.»",
  "قال رسول الله ﷺ: «من غشنا فليس منا.»",
  "قال رسول الله ﷺ: «أعطِ الأجير أجره قبل أن يجف عرقه.»",
  "قال رسول الله ﷺ: «اتقوا النار ولو بشق تمرة.»",
  "قال رسول الله ﷺ: «إن الله رفيق يحب الرفق في الأمر كله.»",
  "قال رسول الله ﷺ: «من لا يستحيي من الناس لا يستحيي من الله.»",
  "قال رسول الله ﷺ: «الراحمون يرحمهم الرحمن.»",
  "قال رسول الله ﷺ: «الخلق كلهم عيال الله، فأحبهم إلى الله أنفعهم لعياله.»",
  "قال رسول الله ﷺ: «خير الناس أنفعهم للناس.»",
  "قال رسول الله ﷺ: «الدين النصيحة.»",
  "قال رسول الله ﷺ: «إذا مات الإنسان انقطع عمله إلا من ثلاث: صدقة جارية، أو علم يُنتفع به، أو ولد صالح يدعو له.»",
  "قال رسول الله ﷺ: «من دل على خير فله مثل أجر فاعله.»",
  "قال رسول الله ﷺ: «من سلك طريقًا يلتمس فيه علمًا، سهل الله له به طريقًا إلى الجنة.»",
  "قال رسول الله ﷺ: «الحياء لا يأتي إلا بخير.»",
  "قال رسول الله ﷺ: «خيركم من تعلم القرآن وعلّمه.»",
  "قال رسول الله ﷺ: «من رأى منكم منكرًا فليغيره بيده، فإن لم يستطع فبلسانه...»",
  "قال رسول الله ﷺ: «من أشار إلى أخيه بحديدة فإن الملائكة تلعنه.»",
  "قال رسول الله ﷺ: «لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه.»",
  "قال رسول الله ﷺ: «انصر أخاك ظالمًا أو مظلومًا.»",
  "قال رسول الله ﷺ: «الكلمة الطيبة صدقة.»",
  "قال رسول الله ﷺ: «من مشى مع مظلوم حتى يثبت له حقه، ثبت الله قدمه يوم تزل الأقدام.»",
  "قال رسول الله ﷺ: «اتقوا الظلم، فإن الظلم ظلمات يوم القيامة.»",
  "قال رسول الله ﷺ: «من صمت نجا.»",
  "قال رسول الله ﷺ: «أفضل الجهاد كلمة حق عند سلطان جائر.»",
  "قال رسول الله ﷺ: «من كتم غيظه، وهو قادر على إنفاذه، دعاه الله على رؤوس الخلائق حتى يخيّره من الحور العين.»",
  "قال رسول الله ﷺ: «من تواضع لله رفعه.»",
  "قال رسول الله ﷺ: «إذا مات ابن آدم انقطع عمله إلا من ثلاث...»",
  "قال رسول الله ﷺ: «من فرّج عن مسلم كربة من كرب الدنيا فرّج الله عنه كربة من كرب يوم القيامة.»",
  "قال رسول الله ﷺ: «من ستر مسلمًا ستره الله في الدنيا والآخرة.»",
  "قال رسول الله ﷺ: «مثل الجليس الصالح كحامل المسك.»",
  "قال رسول الله ﷺ: «من سلك طريقًا يلتمس فيه علمًا، سهل الله له به طريقًا إلى الجنة.»",
  "قال رسول الله ﷺ: «إذا أحب الله عبدًا ابتلاه.»",
  "قال رسول الله ﷺ: «الدال على الخير كفاعله.»",
  "قال رسول الله ﷺ: «ما من مسلم يغرس غرسًا إلا كان له صدقة.»",
  "قال رسول الله ﷺ: «من كان يؤمن بالله واليوم الآخر فليقل خيرًا أو ليصمت.»",
  "قال رسول الله ﷺ: «من قال سبحان الله وبحمده مئة مرة غُفرت له ذنوبه.»",
  "قال رسول الله ﷺ: «من عاد مريضًا لم يزل في خُرفة الجنة حتى يرجع.»",
  "قال رسول الله ﷺ: «من كان له ثلاث بنات فصبر عليهن دخل الجنة.»",
  "قال رسول الله ﷺ: «من نفّس عن مؤمن كربة من كرب الدنيا نفّس الله عنه كربة من كرب يوم القيامة.»",
  "قال رسول الله ﷺ: «من بنى لله مسجدًا بنى الله له مثله في الجنة.»",
  "قال رسول الله ﷺ: «ثلاثة لا يُكلمهم الله يوم القيامة ولا ينظر إليهم: العاق لوالديه، والمرأة المترجلة، والديوث.»",
  "قال رسول الله ﷺ: «من دعا إلى هدى، كان له من الأجر مثل أجور من تبعه لا ينقص ذلك من أجورهم شيئًا.»",
  "قال رسول الله ﷺ: «من قال: سبحان الله وبحمده في يوم مئة مرة حطت خطاياه وإن كانت مثل زبد البحر.»",
  "قال رسول الله ﷺ: «من أحب أن يُبسط له في رزقه، ويُنسأ له في أثره، فليصل رحمه.»",
  "قال رسول الله ﷺ: «إن الله يحب العبد التقي الغني الخفي.»",
  "قال رسول الله ﷺ: «من كان سهلاً هينًا لينًا حرمه الله على النار.»",
  "قال رسول الله ﷺ: «لا تدخلوا الجنة حتى تؤمنوا، ولا تؤمنوا حتى تحابوا.»",
  "قال رسول الله ﷺ: «إن الرجل ليبلغ بحسن خلقه درجة الصائم القائم.»",
  "قال رسول الله ﷺ: «ما نحل والد ولده من نحلة أفضل من أدب حسن.»",
  "قال رسول الله ﷺ: «المسلم مرآة المسلم، والمسلم أخو المسلم.»",
  "قال رسول الله ﷺ: «أحب الكلام إلى الله: سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر.»",
  "قال رسول الله ﷺ: «ما من مسلم يغرس غرسًا فيأكل منه طير أو إنسان أو بهيمة إلا كان له به صدقة.»",
  "قال رسول الله ﷺ: «من كان يؤمن بالله واليوم الآخر فلا يؤذِ جاره.»",
  "قال رسول الله ﷺ: «إن المقسطين عند الله على منابر من نور.»",
  "قال رسول الله ﷺ: «من سره أن يُزحزح عن النار ويدخل الجنة فلتأته منيته وهو يؤمن بالله واليوم الآخر.»",
  "قال رسول الله ﷺ: «من صلّى البردين دخل الجنة.»",
  "قال رسول الله ﷺ: «الطهور شطر الإيمان.»",
  "قال رسول الله ﷺ: «أفضل الصدقة سقي الماء.»",
  "قال رسول الله ﷺ: «من أقال مسلمًا بيعته، أقاله الله عثرته يوم القيامة.»",
  "قال رسول الله ﷺ: «لا يدخل الجنة قاطع رحم.»",
  "قال رسول الله ﷺ: «إذا التقى المسلمان بسيفيهما فالقاتل والمقتول في النار.»",
  "قال رسول الله ﷺ: «من لم يشكر القليل لم يشكر الكثير.»",
  "قال رسول الله ﷺ: «من سأل الناس أموالهم تكثّرًا فإنما يسأل جمراً.»",
  "قال رسول الله ﷺ: «إذا أحب الله عبدًا نادى جبريل: إن الله يحب فلانًا فأحبّه.»",
  "قال رسول الله ﷺ: «إن الله تجاوز لأمتي عن الخطأ والنسيان وما استُكرهوا عليه.»",
  "قال رسول الله ﷺ: «من قام رمضان إيمانًا واحتسابًا غُفر له ما تقدم من ذنبه.»",
  "قال رسول الله ﷺ: «إن الله يغار، وغيرة الله أن يأتي المؤمن ما حرّم الله عليه.»",
  "قال رسول الله ﷺ: «إن الله كتب الإحسان على كل شيء.»",
  "قال رسول الله ﷺ: «من أحب أن يزحزح عن النار ويدخل الجنة فلتأته منيته وهو يؤمن بالله واليوم الآخر.»",
  "قال رسول الله ﷺ: «لا يؤمن عبد حتى يحب لأخيه ما يحب لنفسه.»",
  "قال رسول الله ﷺ: «من استطاع منكم أن يكون له خبء من عمل صالح فليفعل.»",
  "قال رسول الله ﷺ: «إن في الجنة بابًا يُقال له الريان، يدخل منه الصائمون يوم القيامة.»",
  "قال رسول الله ﷺ: «من غش فليس منا.»",
  "قال رسول الله ﷺ: «ما من عبد مسلم يصلي لله تعالى كل يوم اثنتي عشرة ركعة تطوعًا غير الفريضة إلا بنى الله له بيتًا في الجنة.»",
  "قال رسول الله ﷺ: «من صلى البردين دخل الجنة.»",
  "قال رسول الله ﷺ: «لا طاعة لمخلوق في معصية الخالق.»",
  "قال رسول الله ﷺ: «إذا أحب أحدكم صاحبه فليُعلمه.»",
  "قال رسول الله ﷺ: «المؤمن للمؤمن كالبنيان يشد بعضه بعضًا.»",
  "قال رسول الله ﷺ: «إن الله كتب الحسنات والسيئات، ثم بيّن ذلك...»",
  "قال رسول الله ﷺ: «أفضل المؤمنين إسلامًا من سلم المسلمون من لسانه ويده.»",
  "قال رسول الله ﷺ: «دع ما يريبك إلى ما لا يريبك.»",
  "قال رسول الله ﷺ: «ما من يوم يصبح العباد فيه إلا ملكان ينزلان، فيقول أحدهما: اللهم أعط منفقًا خلفًا...»",
  "قال رسول الله ﷺ: «من أنظر معسرًا أو وضع عنه أظله الله في ظله يوم لا ظل إلا ظله.»",
  "قال رسول الله ﷺ: «من غسل ميتًا فستره ستره الله من الذنوب.»",
  "قال رسول الله ﷺ: «من شهد أن لا إله إلا الله وأن محمدًا رسول الله دخل الجنة.»",
  "قال رسول الله ﷺ: «الجنة أقرب إلى أحدكم من شراك نعله، والنار مثل ذلك.»",
  "قال رسول الله ﷺ: «أقرب ما يكون العبد من ربه وهو ساجد، فأكثروا الدعاء.»",
  "قال رسول الله ﷺ: «خيركم من يرجى خيره ويؤمن شره.»",
  "قال رسول الله ﷺ: «من حج فلم يرفث ولم يفسق رجع كيوم ولدته أمه.»",
  "قال رسول الله ﷺ: «التائب من الذنب كمن لا ذنب له.»",
  "قال رسول الله ﷺ: «من ستر عورة أخيه المسلم ستر الله عورته يوم القيامة.»",
"قال رسول الله ﷺ: «لا تحاسدوا، ولا تناجشوا، ولا تباغضوا، وكونوا عباد الله إخوانًا.»",
"قال رسول الله ﷺ: «اتق المحارم تكن أعبد الناس، وارض بما قسم الله لك تكن أغنى الناس.»",
"قال رسول الله ﷺ: «من سل سيفًا على مسلم فقد أقبل بسيفه إلى النار.»",
"قال رسول الله ﷺ: «من قال لا إله إلا الله نفعته يومًا من دهره يصيبه قبل ذلك ما أصابه.»",
"قال رسول الله ﷺ: «البر لا يبلى، والذنب لا يُنسى، والديان لا يموت.»",
"قال رسول الله ﷺ: «اتقوا النار ولو بشق تمرة، فإن لم تجدوا فبكلمة طيبة.»",
"قال رسول الله ﷺ: «من جاءكم وأمركم جميع على رجل واحد يريد أن يشق عصاكم فاقتلوه.»",
"قال رسول الله ﷺ: «من أحب أن يُبسط له في رزقه ويُنسأ له في أثره فليصل رحمه.»",
"قال رسول الله ﷺ: «كفى بالمرء كذبًا أن يحدث بكل ما سمع.»",
"قال رسول الله ﷺ: «من تشبّه بقوم فهو منهم.»",
"قال رسول الله ﷺ: «الماهر بالقرآن مع السفرة الكرام البررة.»",
"قال رسول الله ﷺ: «من قام بعشر آيات لم يُكتب من الغافلين.»",
"قال رسول الله ﷺ: «من صلّى عليّ واحدة صلى الله عليه بها عشرًا.»",
"قال رسول الله ﷺ: «أكمل المؤمنين إيمانًا أحسنهم خلقًا.»",
"قال رسول الله ﷺ: «أحب الناس إلى الله أنفعهم للناس.»",
"قال رسول الله ﷺ: «أعفّ الناس من عفّ عن محارم الناس.»",
"قال رسول الله ﷺ: «من لا يَشكر الناس لا يَشكر الله.»",
"قال رسول الله ﷺ: «من غفر للناس غفر الله له.»",
"قال رسول الله ﷺ: «أوصيكم بالنساء خيرًا.»",
"قال رسول الله ﷺ: «إن من أحبكم إليّ وأقربكم مني مجلسًا يوم القيامة أحاسنكم أخلاقًا.»",
"قال رسول الله ﷺ: «من لا يُوقر كبيرنا ولا يرحم صغيرنا فليس منا.»",
"قال رسول الله ﷺ: «لعن الله الراشي والمرتشي.»",
"قال رسول الله ﷺ: «من صلى البردين دخل الجنة.»",
"قال رسول الله ﷺ: «من أشار إلى أخيه بحديدة تلعنه الملائكة.»",
"قال رسول الله ﷺ: «من قال سبحان الله وبحمده مئة مرة غفرت له ذنوبه وإن كانت مثل زبد البحر.»",
"قال رسول الله ﷺ: «من توضأ فأحسن الوضوء خرجت خطاياه من جسده.»",
"قال رسول الله ﷺ: «إذا توضأ العبد المسلم فغسل وجهه خرجت كل خطيئة نظر إليها بعينيه.»",
"قال رسول الله ﷺ: «إذا دخل رمضان فتحت أبواب الجنة وغلقت أبواب النار.»",
"قال رسول الله ﷺ: «من فطر صائمًا كان له مثل أجره.»",
"قال رسول الله ﷺ: «من قام ليلة القدر إيمانًا واحتسابًا غفر له ما تقدم من ذنبه.»",
"قال رسول الله ﷺ: «من دعا لأخيه بظهر الغيب قال الملك: آمين ولك بمثل.»",
"قال رسول الله ﷺ: «من كان في حاجة أخيه كان الله في حاجته.»",
"قال رسول الله ﷺ: «من عال جاريتين حتى تبلغا جاء يوم القيامة أنا وهو كهاتين.»",
"قال رسول الله ﷺ: «من قرأ حرفًا من كتاب الله فله به حسنة، والحسنة بعشر أمثالها.»",
"قال رسول الله ﷺ: «أقربكم مني مجلسًا يوم القيامة أحاسنكم أخلاقًا.»",
"قال رسول الله ﷺ: «من قال حين يصبح وحين يمسي: حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم، سبع مرات، كفاه الله.»",
"قال رسول الله ﷺ: «خيركم خيركم لأهله، وأنا خيركم لأهلي.»",
"قال رسول الله ﷺ: «إن الله يحب إذا عمل أحدكم عملًا أن يتقنه.»",
"قال رسول الله ﷺ: «من رأى منكم منكرًا فليغيره بيده...»",
"قال رسول الله ﷺ: «لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر.»",
"قال رسول الله ﷺ: «من عادى لي وليًا فقد آذنته بالحرب.»",
"قال رسول الله ﷺ: «كل أمتي معافى إلا المجاهرين.»",
"قال رسول الله ﷺ: «اتق الله حيثما كنت، وأتبع السيئة الحسنة تمحها، وخالق الناس بخلق حسن.»",
"قال رسول الله ﷺ: «الظلم ظلمات يوم القيامة.»",
"قال رسول الله ﷺ: «إذا أحب الله عبدًا استعمله.»",
"قال رسول الله ﷺ: «المسلم أخو المسلم لا يظلمه ولا يسلمه.»",
"قال رسول الله ﷺ: «يُبعث المرء على ما مات عليه.»",
"قال رسول الله ﷺ: «خيركم من طال عمره وحسن عمله.»",
"قال رسول الله ﷺ: «من دل على خير فله مثل أجر فاعله.»",
"قال رسول الله ﷺ: «من مات وهو يعلم أن لا إله إلا الله دخل الجنة.»",
"قال رسول الله ﷺ: «من توضأ فأحسن الوضوء ثم قال: أشهد أن لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، فُتحت له أبواب الجنة الثمانية.»",
"قال رسول الله ﷺ: «من صلى الفجر في جماعة فهو في ذمة الله.»",
"قال رسول الله ﷺ: «من يرد الله به خيرًا يفقهه في الدين.»",
"قال رسول الله ﷺ: «المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف.»",
"قال رسول الله ﷺ: «من حسن إسلام المرء تركه ما لا يعنيه.»",
"قال رسول الله ﷺ: «من صلّى عليّ صلاة واحدة صلى الله عليه بها عشرًا.»",
"قال رسول الله ﷺ: «من قرأ آية الكرسي دبر كل صلاة لم يمنعه من دخول الجنة إلا أن يموت.»",
"قال رسول الله ﷺ: «لا يزال لسانك رطبًا من ذكر الله.»",
"قال رسول الله ﷺ: «طوبى لمن وجد في صحيفته استغفارًا كثيرًا.»",
"قال رسول الله ﷺ: «من أقال نادمًا أقاله الله عثرته يوم القيامة.»",
"قال رسول الله ﷺ: «من تواضع لله رفعه.»",
"قال رسول الله ﷺ: «من دعا إلى ضلالة كان عليه من الإثم مثل آثام من تبعه لا ينقص من آثامهم شيئًا.»",
"قال رسول الله ﷺ: «من أحب لقاء الله أحب الله لقاءه.»",
"قال رسول الله ﷺ: «إن العبد ليتكلم بالكلمة لا يرى بها بأسًا يهوي بها في النار سبعين خريفًا.»",
"قال رسول الله ﷺ: «إذا أحب الله عبدًا قال لجبريل: إني أحب فلانًا فأحبه...»",
"قال رسول الله ﷺ: «أقيلوا ذوي الهيئات عثراتهم.»",
"قال رسول الله ﷺ: «من جاءكم من ترضون دينه وخلقه فزوّجوه.»",
"قال رسول الله ﷺ: «دعوة الأخ لأخيه بظهر الغيب مستجابة.»",
"قال رسول الله ﷺ: «إن الله لا ينظر إلى أجسامكم ولا إلى صوركم ولكن ينظر إلى قلوبكم وأعمالكم.»",
"قال رسول الله ﷺ: «من لا يَرحم لا يُرحم.»",
"قال رسول الله ﷺ: «من أحب أن يزحزح عن النار ويدخل الجنة فلتأته منيته وهو يؤمن بالله واليوم الآخر.»",
"قال رسول الله ﷺ: «من سأل الله الشهادة بصدق بلغه الله منازل الشهداء وإن مات على فراشه.»",
"قال رسول الله ﷺ: «من عاد مريضًا أو زار أخًا له في الله ناداه منادٍ أن طبت وطاب ممشاك...»",
"قال رسول الله ﷺ: «أحبّ الأعمال إلى الله سرور تدخله على مسلم.»",
"قال رسول الله ﷺ: «ما نقص مال من صدقة.»",
"قال رسول الله ﷺ: «من كظم غيظًا وهو قادر على إنفاذه دعاه الله على رؤوس الخلائق حتى يخيره من الحور العين.»",
"قال رسول الله ﷺ: «من أنظر معسرًا أو وضع له أظله الله في ظله.»",
"قال رسول الله ﷺ: «من خرج في طلب العلم فهو في سبيل الله حتى يرجع.»",
"قال رسول الله ﷺ: «الصدقة تطفئ الخطيئة كما يطفئ الماء النار.»",
"قال رسول الله ﷺ: «ألا أخبركم بأفضل من درجة الصلاة والصيام والصدقة؟ قالوا: بلى. قال: إصلاح ذات البين.»",
"قال رسول الله ﷺ: «ثلاث من كن فيه وجد بهن حلاوة الإيمان...»",
"قال رسول الله ﷺ: «لا تغضب.»",
"قال رسول الله ﷺ: «ليس الشديد بالصرعة، إنما الشديد الذي يملك نفسه عند الغضب.»",
"قال رسول الله ﷺ: «المسلمون تتكافأ دماؤهم، ويسعى بذمتهم أدناهم.»",
"قال رسول الله ﷺ: «لا يدخل الجنة من لا يأمن جاره بوائقه.»",
"قال رسول الله ﷺ: «المؤمنون تتكافأ دماؤهم، وهم يد على من سواهم.»",
"قال رسول الله ﷺ: «الراحمون يرحمهم الرحمن، ارحموا من في الأرض يرحمكم من في السماء.»",
"قال رسول الله ﷺ: «خير الأصحاب عند الله خيرهم لصاحبه.»",
"قال رسول الله ﷺ: «خير الجيران عند الله خيرهم لجاره.»",
"قال رسول الله ﷺ: «الكلمة الطيبة صدقة.»",
"قال رسول الله ﷺ: «تبسمك في وجه أخيك صدقة.»",
"قال رسول الله ﷺ: «اليد العليا خير من اليد السفلى.»",
"قال رسول الله ﷺ: «من لا يشكر القليل لا يشكر الكثير.»",
"قال رسول الله ﷺ: «صنائع المعروف تقي مصارع السوء.»",
"قال رسول الله ﷺ: «لا تماري أخاك، ولا تمازحه، ولا تعده موعدًا فتخلفه.»",
"قال رسول الله ﷺ: «من تشبّه بقوم فهو منهم.»",
"قال رسول الله ﷺ: «المرء مع من أحب.»",
"قال رسول الله ﷺ: «من حسن إسلام المرء تركه ما لا يعنيه.»",
"قال رسول الله ﷺ: «من صلّى عليّ حين يُصبح عشرًا، وحين يُمسي عشرًا، أدركته شفاعتي يوم القيامة.»",
"قال رسول الله ﷺ: «الدين النصيحة، قلنا لمن؟ قال: لله، ولكتابه، ولرسوله، ولأئمة المسلمين وعامتهم.»",
"قال رسول الله ﷺ: «ليس منا من لم يوقر كبيرنا، ويرحم صغيرنا، ويأمر بالمعروف، وينهى عن المنكر.»",
"قال رسول الله ﷺ: «من لا يُؤتمن لا يُؤمن.»",
"قال رسول الله ﷺ: «إنما بعثت لأتمم مكارم الأخلاق.»",
"قال رسول الله ﷺ: «ليس المؤمن بالطعان، ولا اللعان، ولا الفاحش، ولا البذيء.»",
"قال رسول الله ﷺ: «لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه.»",
"قال رسول الله ﷺ: «المؤمن مرآة أخيه.»",
"قال رسول الله ﷺ: «من لا يَرحم لا يُرحم، ومن لا يغفر لا يُغفر له.»",
"قال رسول الله ﷺ: «من لم يشكر الناس لم يشكر الله.»",
"قال رسول الله ﷺ: «حق المسلم على المسلم ست: إذا لقيته فسلم عليه...»",
"قال رسول الله ﷺ: «أحبوا الفقراء وجالسوهم، فإني سمعت حبيبي يقول: قربهم تقرب إلى الله.»",
"قال رسول الله ﷺ: «أكثروا من ذكر هادم اللذات.»",
"قال رسول الله ﷺ: «ارحموا من في الأرض يرحمكم من في السماء.»",
"قال رسول الله ﷺ: «من استطاع أن ينفع أخاه فليفعل.»",
"قال رسول الله ﷺ: «من أصبح منكم آمنًا في سربه، معافى في بدنه، عنده قوت يومه، فكأنما حيزت له الدنيا.»",
"قال رسول الله ﷺ: «لا يحل لمسلم أن يهجر أخاه فوق ثلاث.»",
"قال رسول الله ﷺ: «من لا يُؤدب ولده فقد خانه.»",
"قال رسول الله ﷺ: «خيركم من تعلم القرآن وعلّمه.»",
"قال رسول الله ﷺ: «من صام رمضان إيمانًا واحتسابًا غُفر له ما تقدم من ذنبه.»",
"قال رسول الله ﷺ: «من فطّر صائمًا فله مثل أجره.»",
"قال رسول الله ﷺ: «من قام مع الإمام حتى ينصرف كُتب له قيام ليلة.»",
"قال رسول الله ﷺ: «من سأل الله الجنة ثلاث مرات، قالت الجنة: اللهم أدخله الجنة.»",
"قال رسول الله ﷺ: «من استعاذ بالله من النار ثلاث مرات، قالت النار: اللهم أجره من النار.»",
"قال رسول الله ﷺ: «من أشار إلى أخيه بسلاح فلا تزال الملائكة تلعنه.»",
"قال رسول الله ﷺ: «اللهم إني أعوذ بك من قلب لا يخشع، ومن علم لا ينفع، ومن دعاء لا يُسمع.»",
"قال رسول الله ﷺ: «من كتم علمًا ألجمه الله بلجام من نار يوم القيامة.»",
"قال رسول الله ﷺ: «ما من عبد يستر عبدًا في الدنيا إلا ستره الله يوم القيامة.»",
"قال رسول الله ﷺ: «من قال: رضيت بالله ربًا، وبالإسلام دينًا، وبمحمد نبيًا، وجبت له الجنة.»",
"قال رسول الله ﷺ: «من دعا إلى هدى كان له من الأجر مثل أجور من تبعه.»",
"قال رسول الله ﷺ: «من ترك الكذب وهو باطل بُني له في الجنة بيت في وسطها.»",
"قال رسول الله ﷺ: «من ترك المراء وهو محق بُني له في الجنة بيت في أعلاها.»",
"قال رسول الله ﷺ: «من حسن إسلام المرء تركه ما لا يعنيه.»",
"قال رسول الله ﷺ: «ليس الشديد بالصرعة ولكن الشديد من يملك نفسه عند الغضب.»",
"قال رسول الله ﷺ: «من لا يشكر القليل لا يشكر الكثير.»",
"قال رسول الله ﷺ: «من لا يُؤتمن لا يُؤمن، ومن لا يرحم لا يُرحم.»",
"قال رسول الله ﷺ: «ما كان الرفق في شيء إلا زانه، وما نُزع من شيء إلا شانه.»",
"قال رسول الله ﷺ: «لا تكثروا الضحك، فإن كثرة الضحك تميت القلب.»",
"قال رسول الله ﷺ: «أقيلوا ذوي الهيئات عثراتهم.»",
"قال رسول الله ﷺ: «من توضأ فأحسن الوضوء، خرجت خطاياه من جسده حتى تخرج من تحت أظفاره.»",
"قال رسول الله ﷺ: «اللهم آت نفوسنا تقواها، وزكّها أنت خير من زكاها.»",
"قال رسول الله ﷺ: «من صلى عليّ حين يصبح وحين يمسي أدركته شفاعتي يوم القيامة.»",
"قال رسول الله ﷺ: «خير ما قلت أنا والنبيون من قبلي: لا إله إلا الله وحده لا شريك له.»",
"قال رسول الله ﷺ: «من قال: سبحان الله وبحمده، غُرست له نخلة في الجنة.»",
"قال رسول الله ﷺ: «إن العبد ليتكلم بالكلمة من رضوان الله، لا يلقي لها بالًا، يرفعه الله بها درجات.»",
"قال رسول الله ﷺ: «كل بني آدم خطّاء، وخير الخطائين التوابون.»",
"قال رسول الله ﷺ: «التائب من الذنب كمن لا ذنب له.»",
"قال رسول الله ﷺ: «من لا حياء له فليس منه خير.»",
"قال رسول الله ﷺ: «إذا لم تستحِ فاصنع ما شئت.»",
"قال رسول الله ﷺ: «إن الله رفيق يحب الرفق في الأمر كله.»",
"قال رسول الله ﷺ: «من لا يُؤتمن لا يُؤمن، ومن لا يُعاهد لا يُواثق.»",
"قال رسول الله ﷺ: «من ستر مسلمًا ستره الله في الدنيا والآخرة.»",
"قال رسول الله ﷺ: «من سلك طريقًا يلتمس فيه علمًا سهّل الله له به طريقًا إلى الجنة.»",
"قال رسول الله ﷺ: «من لا يَرحم لا يُرحم.»",
"قال رسول الله ﷺ: «من أحب شيئًا أكثر من ذكره.»",
"قال رسول الله ﷺ: «الدعاء هو العبادة.»",
"قال رسول الله ﷺ: «الحياء لا يأتي إلا بخير.»",
"قال رسول الله ﷺ: «لا تزول قدما عبد يوم القيامة حتى يُسأل عن أربع.»",
"قال رسول الله ﷺ: «من غشنا فليس منا.»",
"قال رسول الله ﷺ: «من استغفر للمؤمنين والمؤمنات كتب الله له بكل مؤمن ومؤمنة حسنة.»",
"قال رسول الله ﷺ: «من توضأ فقال: أشهد أن لا إله إلا الله وحده لا شريك له، كُتبت له ثماني أبواب الجنة.»",
"قال رسول الله ﷺ: «من مشى في حاجة أخيه كان خيرًا له من اعتكاف عشر سنين.»",
"قال رسول الله ﷺ: «أكثروا من قول: لا حول ولا قوة إلا بالله.»",
"قال رسول الله ﷺ: «من أحب عملًا أُعين عليه.»",
"قال رسول الله ﷺ: «من رزقهن الله الصبر، نال عظيم الأجر.»",
"قال رسول الله ﷺ: «من فرج عن مسلم كربة من كرب الدنيا فرّج الله عنه كربة من كرب يوم القيامة.»",
"قال رسول الله ﷺ: «الدنيا سجن المؤمن وجنة الكافر.»",
"قال رسول الله ﷺ: «من أحب لله وأبغض لله وأعطى لله ومنع لله فقد استكمل الإيمان.»",
"قال رسول الله ﷺ: «البلاء موكل بالمنطق.»",
"قال رسول الله ﷺ: «من أصبح وهو ينوي الخير أعانه الله عليه.»",
"قال رسول الله ﷺ: «الخلق كلهم عيال الله، فأحبهم إلى الله أنفعهم لعياله.»",
"قال رسول الله ﷺ: «من سأل بالله فأعطوه.»",
"قال رسول الله ﷺ: «اليمين الكاذبة ممحقة للرزق.»",
"قال رسول الله ﷺ: «اتقوا دعوة المظلوم فإنها تُحمل على الغمام.»",
"قال رسول الله ﷺ: «اليد العليا خير من اليد السفلى، وابدأ بمن تعول.»",
"قال رسول الله ﷺ: «كل معروف صدقة.»",
"قال رسول الله ﷺ: «الناس معادن كمعادن الذهب والفضة.»",
"قال رسول الله ﷺ: «خير ما ترك الرجل بعده ثلاث: ولد صالح، وصدقة جارية، وعلم يُنتفع به.»",
"قال رسول الله ﷺ: «إذا مات ابن آدم انقطع عمله إلا من ثلاث...»",
"قال رسول الله ﷺ: «الطهور شطر الإيمان.»",
"قال رسول الله ﷺ: «ما من يوم يُصبح العباد فيه إلا وملكان ينزلان...»",
"قال رسول الله ﷺ: «لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه.»",
"قال رسول الله ﷺ: «الجار قبل الدار، والرفيق قبل الطريق.»",
"قال رسول الله ﷺ: «لا يُلدغ المؤمن من جحر مرتين.»",
"قال رسول الله ﷺ: «المرء على دين خليله فلينظر أحدكم من يُخالل.»",
"قال رسول الله ﷺ: «من صبر على أذى الناس نال عظيم الثواب.»",
"قال رسول الله ﷺ: «من أكرم ضيفه فقد أكرم الله.»",
"قال رسول الله ﷺ: «من ترك شيئًا لله عوضه الله خيرًا منه.»",
"قال رسول الله ﷺ: «من أحب لقاء الله أحب الله لقاءه.»",
"قال رسول الله ﷺ: «لا تدخلوا الجنة حتى تؤمنوا، ولا تؤمنوا حتى تحابوا.»",
"قال رسول الله ﷺ: «المسلم من سلم المسلمون من لسانه ويده.»",
"قال رسول الله ﷺ: «إن الله كتب الإحسان على كل شيء.»",
"قال رسول الله ﷺ: «من لا يشكر الناس لا يشكر الله.»",
"قال رسول الله ﷺ: «ليس الغني عن كثرة العرض، ولكن الغني غني النفس.»",
"قال رسول الله ﷺ: «استوصوا بالنساء خيرًا.»",
"قال رسول الله ﷺ: «أفضل الجهاد كلمة حق عند سلطان جائر.»",
"قال رسول الله ﷺ: «ازهد في الدنيا يحبك الله، وازهد فيما عند الناس يحبك الناس.»",
"قال رسول الله ﷺ: «المرء يحشر مع من أحب.»",
"قال رسول الله ﷺ: «من دعا لأخيه بظهر الغيب قال الملك الموكل: آمين ولك بمثل.»",
"قال رسول الله ﷺ: «الناس كإبل مائة لا تكاد تجد فيها راحلة.»",
"قال رسول الله ﷺ: «من سأل الله الثبات فليدعُ به كثيرًا.»",
"قال رسول الله ﷺ: «من عاد مريضًا وجد الله عنده.»",
"قال رسول الله ﷺ: «من يُرد الله به خيرًا يُصِب منه.»",
"قال رسول الله ﷺ: «من قرأ عشر آيات في ليلة لم يُكتب من الغافلين.»",
"قال رسول الله ﷺ: «خيركم من يرجى خيره ويؤمن شره.»",
"قال رسول الله ﷺ: «أقربكم مني مجلسًا يوم القيامة أحاسنكم أخلاقًا.»",
"قال رسول الله ﷺ: «من أحب لله وأبغض لله وأعطى لله ومنع لله فقد استكمل الإيمان.»",
"قال رسول الله ﷺ: «من توضأ مثل وضوئي هذا ثم صلى ركعتين لا يُحدث فيهما نفسه غُفر له ما تقدم من ذنبه.»",
"قال رسول الله ﷺ: «إن من أحبكم إليّ وأقربكم مني مجلسًا يوم القيامة أحاسنكم أخلاقًا.»",
"قال رسول الله ﷺ: «من نفّس عن مؤمن كربة من كرب الدنيا نفّس الله عنه كربة من كرب يوم القيامة.»",
"قال رسول الله ﷺ: «لا يشكر الله من لا يشكر الناس.»",
"قال رسول الله ﷺ: «من دعا إلى هدى كان له مثل أجر من تبعه.»",
"قال رسول الله ﷺ: «من قرأ حرفًا من كتاب الله فله به حسنة، والحسنة بعشر أمثالها.»",
"قال رسول الله ﷺ: «أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء.»",
"قال رسول الله ﷺ: «رحم الله امرأً قال خيرًا فغنم، أو سكت عن سوء فسلم.»",
"قال رسول الله ﷺ: «من كظم غيظًا وهو قادر على إنفاذه دعاه الله على رؤوس الخلائق حتى يخيّره من الحور العين.»",
"قال رسول الله ﷺ: «من صام يومًا في سبيل الله باعد الله وجهه عن النار سبعين خريفًا.»",
"قال رسول الله ﷺ: «من قال سبحان الله وبحمده في يوم مئة مرة حُطت خطاياه ولو كانت مثل زبد البحر.»",
"قال رسول الله ﷺ: «الدنيا ملعونة، ملعون ما فيها إلا ذكر الله وما والاه.»",
"قال رسول الله ﷺ: «الماهر بالقرآن مع السفرة الكرام البررة.»",
"قال رسول الله ﷺ: «اقرؤوا القرآن، فإنه يأتي يوم القيامة شفيعًا لأصحابه.»",
"قال رسول الله ﷺ: «إن الله جميل يحب الجمال.»",
"قال رسول الله ﷺ: «أفضل المؤمنين أحسنهم خلقًا.»",
"قال رسول الله ﷺ: «المؤمن إذا دُعي إلى الله لبى، وإذا نُصح قبل.»",
"قال رسول الله ﷺ: «من لا يشكر الناس لا يشكر الله.»",
"قال رسول الله ﷺ: «احفظ الله يحفظك.»",
"قال رسول الله ﷺ: «الصدق يهدي إلى البر، والبر يهدي إلى الجنة.»",
"قال رسول الله ﷺ: «كفى بالمرء كذبًا أن يحدث بكل ما سمع.»",
"قال رسول الله ﷺ: «دع ما يريبك إلى ما لا يريبك.»",
"قال رسول الله ﷺ: «الراحمون يرحمهم الرحمن.»",
"قال رسول الله ﷺ: «من غفر وعفا زاده الله عزًا.»",
"قال رسول الله ﷺ: «إذا مات الإنسان انقطع عمله إلا من ثلاث.»",
"قال رسول الله ﷺ: «من أحب أن يبسط له في رزقه ويُنسأ له في أثره فليصل رحمه.»",
"قال رسول الله ﷺ: «من لا يُؤتمن لا يُؤمن.»",
"قال رسول الله ﷺ: «من يُرد الله به خيرًا يُفقهه في الدين.»",
"قال رسول الله ﷺ: «من صلّى عليّ مرة، صلى الله عليه بها عشرًا.»",
"قال رسول الله ﷺ: «من حسن إسلام المرء تركه ما لا يعنيه.»",
"قال رسول الله ﷺ: «أعذر الله إلى امرئ أخر أجله حتى بلغ الستين.»",
"قال رسول الله ﷺ: «ثلاث من كن فيه وجد حلاوة الإيمان: أن يكون الله ورسوله أحب إليه مما سواهما...»",
"قال رسول الله ﷺ: «خيركم خيركم لأهله، وأنا خيركم لأهلي.»",
"قال رسول الله ﷺ: «اللهم كما أحسنت خَلقي فأحسن خُلقي.»",
"قال رسول الله ﷺ: «من رأى منكم منكرًا فليغيره بيده...»",
"قال رسول الله ﷺ: «لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه.»",
"قال رسول الله ﷺ: «الصلاة نور.»",
"قال رسول الله ﷺ: «القرآن حجة لك أو عليك.»",
"قال رسول الله ﷺ: «استعينوا بالصبر والصلاة.»",
"قال رسول الله ﷺ: «اليد العليا خير من اليد السفلى.»",
"قال رسول الله ﷺ: «البر لا يبلى، والذنب لا يُنسى، والديان لا يموت.»"
]
